# Дан словарь на 6 персон, найти и вывести их средний возраст. (Пример,
# {"Андрей": 32, "Виктор": 29, "Максим": 18, …}, среднее 26,33).
import random

# Генерация словаря
names = ["Андрей", "Виктор", "Максим", "Ольга", "Антон", "Татьяна",
         "Артём", "Владимир", "Владислав", "Олег", "Пётр", "Марина", "Юрий"]
random.shuffle(names)
dict_len = 6
dict1 = {}
for i in range(dict_len):
    dict1[names[i]] = random.randint(15, 45)
print(dict1)

# Решение
print(sum(dict1.values()) / len(dict1))