# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные.

str1 = input("Введите строку: ")
print(str1.lower())