# Вывести трёхзначное число справа на лево.

num = input("Введите трёхзначное число: ")
print(num[::-1])