# Вывести трёхзначное число справа налево.


num = input("Введите трёхзначное число: ")
print(num[::-1])